fluffyrabbot/powerfinger/firmware/pen/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# PowerPen — Default Kconfig

# Target: ESP32-C3
CONFIG_IDF_TARGET="esp32c3"

# Flash: 4MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table: custom (OTA A/B + NVS)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bluetooth: NimBLE only (no classic BT on C3)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# NimBLE: enable bonding, security manager
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# NimBLE: max connections (pen is peripheral, 1 connection)
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# Power management: enable light sleep
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# Watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# OTA: enable
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Log level: info for development
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- PowerPen-specific overrides ---

# Form factor identity
CONFIG_POWERFINGER_FORM_FACTOR_PEN=y

# Device name: "PowerPen"
CONFIG_POWERFINGER_DEVICE_NAME="PowerPen"

# Sensor: ball+Hall prototype
CONFIG_SENSOR_BALL_HALL=y
CONFIG_POWERFINGER_HALL_ADC_CH_X_POS=0
CONFIG_POWERFINGER_HALL_ADC_CH_X_NEG=1
CONFIG_POWERFINGER_HALL_ADC_CH_Y_POS=2
CONFIG_POWERFINGER_HALL_ADC_CH_Y_NEG=3

# Click: PP3 uses the pen-specific dual-GPIO driver selected behind the shared
# CLICK_SNAP_DOME mode. The compatibility alias stays mapped to the barrel pin.
CONFIG_CLICK_SNAP_DOME=y
CONFIG_POWERFINGER_BARREL_PIN=4
CONFIG_POWERFINGER_TIP_DOME_PIN=5
CONFIG_POWERFINGER_DOME_PIN=4

# Wake sources: barrel, tip dome, DRV5032 (GPIO4 | GPIO5 | GPIO8)
CONFIG_POWERFINGER_WAKE_SENSOR_PIN=8
CONFIG_POWERFINGER_WAKE_GPIO_MASK=304

# Hall power gate and battery monitor
CONFIG_POWERFINGER_HALL_POWER_PIN=6
CONFIG_POWERFINGER_HALL_POWER_ACTIVE_LOW=y
CONFIG_POWERFINGER_VBAT_ADC_CHANNEL=7
